package ru.pavlenty.cityfragment_example.data;

public class City {

    public static String[] cityMenu = {
            "МОСКВА",
            "ВАШИНГТОН",
            "БЕРЛИН"
    };

    public static String[] cityDetails = {
            "Москва́ (произношение (инф.)) — столица России, город федерального значения, административный центр Центрального федерального округа и центр Московской области, в состав которой не входит[5]. Крупнейший по численности населения город России и её субъект — 12 692 466[2] чел. (2020), самый населённый из городов, полностью расположенных в Европе, входит в десятку городов мира по численности населения[6], крупнейший русскоязычный город в мире. Центр Московской городской агломерации. Центр Русской православной церкви.\n" +
                    "\n" +
                    "Историческая столица Великого княжества Московского, Русского царства, Российской империи (в 1728—1730 годах), Советской России и СССР. Город-герой. В Москве находятся федеральные органы государственной власти Российской Федерации (за исключением Конституционного суда), посольства иностранных государств, штаб-квартиры большинства крупнейших российских коммерческих организаций и общественных объединений.\n" +
                    "\n" +
                    "Расположена на западе России, на реке Москве в центре Восточно-Европейской равнины, в междуречье Оки и Волги. Как субъект федерации, Москва граничит с Московской и Калужской областями.",

            "Вашингто́н (англ. Washington, D.C., МФА: [ˈwɑʃɪŋtən ˌdiː ˌsiː]) — город, столица Соединённых Штатов Америки. Официальное название — округ Колумбия (англ. District of Columbia, сокращённо D.C., «Ди-Си»). Чтобы не путать город с одноимённым штатом на северо-западе страны, американцы в разговорной речи обычно называют город «Ди-Си» или «Вашингтон, Ди-Си».\n" +
                    "\n" +
                    "Федеральный округ Колумбия является самостоятельной территорией, не входящей ни в один из штатов. Он был образован в 1790 году Актом о местопребывании[en] и включал город Джорджтаун, а также город Александрию (до 1846 года). Город Вашингтон был основан в 1791 году и назван в честь Джорджа Вашингтона, первого американского президента. В 1871 году города Вашингтон и Джорджтаун и округ Вашингтон были формально упразднены как самостоятельные административные единицы и объединены с округом Колумбия.\n" +
                    "\n" +
                    "Город расположен на северном берегу реки Потомак и граничит со штатом Виргиния на юго-западе и штатом Мэриленд со всех других сторон. Постоянное население города составляет свыше 600 тысяч человек[1]; из-за приезда жителей пригородной зоны во время рабочей недели оно увеличивается до одного миллиона. Население Вашингтонской агломерации, частью которой является город, составляет 5,4 миллиона человек; по этому показателю агломерация занимает восьмое место в стране[2].",
            "Берли́н (нем. Berlin [bɛɐ̯ˈliːn], произношение (инф.)) — столица и крупнейший город Германии, первый по населению и четвёртый по площади город Евросоюза.\n" +
                    "\n" +
                    "Является одной из 16 земель в составе ФРГ. Город расположен на берегах рек:\n" +
                    "\n" +
                    "Шпрее (в связи с чем его называют «Афинами на Шпрее»),\n" +
                    "Хафель в центре федеральной земли Бранденбург (частью последней Берлин не является с 1920 года).\n" +
                    "Около 1200 года на месте современного Берлина располагались два торговых поселения — Кёлльн и Берлин. Точная дата получения ими городских прав неизвестна. Городские права Кёлльна впервые упоминаются в 1237 году, городские права Берлина — в 1244 году. В 1307 году города объединились и образовали общую городскую управу. В 1400 году население объединённого Берлина составляло 8000 человек. Историческое название «Кёлльн» нашло своё отражение в названии берлинского района Нойкёльн.\n" +
                    "\n" +
                    "Берлин был столицей маркграфства/курфюршества Бранденбургского (с 1417 года), Пруссии (после объединения курфюршества Бранденбург с герцогством Пруссия) и после создания Германской империи стал её столицей."
    };
}
